app/controllers/api/v1/collaborators_controller.rb

SELECT "collaborators".* FROM "collaborators"
---
      def index
        collaborators = Collaborator.all

INSERT INTO "collaborators" ("name", "position", "hire_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Joao"], ["position", "Dev"], ["hire_date", "2023-07-26"], ["created_at", "2023-07-31 21:23:36.109871"], ["updated_at", "2023-07-31 21:23:36.109871"]]
---
      def create
        collaborator = Collaborator.new(collaborator_params)

        if collaborator.save

SELECT "collaborators".* FROM "collaborators" WHERE "collaborators"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
      def set_collaborator
        @collaborator = Collaborator.find(params[:id])