app/controllers/api/v1/vacations_controller.rb

      def create
        vacation = @collaborator.vacations.build(vacation_params)

        if vacation.save
          render json: vacation, status: :created
        else
          if vacation.errors[:base].present?
---
INSERT INTO "vacations" ("collaborator_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["collaborator_id", 2], ["start_date", "2023-07-01"], ["end_date", "2023-07-31"], ["created_at", "2023-07-31 21:49:11.925788"], ["updated_at", "2023-07-31 21:49:11.925788"]]
SELECT 1 AS one FROM "vacations" WHERE "vacations"."collaborator_id" = $1 AND (start_date <= '2023-07-31' AND end_date >= '2023-07-01') LIMIT $2  [["collaborator_id", 2], ["LIMIT", 1]]

      def set_collaborator
        @collaborator = Collaborator.find(params[:collaborator_id])
---
SELECT "collaborators".* FROM "collaborators" WHERE "collaborators"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]