app/models/vacation.rb

  def validate_no_overlapping_vacations
    if collaborator.vacations.where("start_date <= ? AND end_date >= ?", end_date, start_date).any?
---
SELECT 1 AS one FROM "vacations" WHERE "vacations"."collaborator_id" = $1 AND (start_date <= '2023-07-31' AND end_date >= '2023-07-01') LIMIT $2  [["collaborator_id", 2], ["LIMIT", 1]]